[
    {
        "YogaStyleName": "Vinyasa",
        "YogaStyleDescription": "Vinyasa style yoga incorporates smooth transitions between asanas in flowing styles of modern yoga as exercise such as Vinyasa Krama Yoga and Ashtanga Vinyasa Yoga, especially when movement is paired with the breath."
    },
    {
        "YogaStyleName": "Power",
        "YogaStyleDescription": "One of the fundamental difference between Vinyasa and power yoga (or high energy) is the speed of practice. When practicing Vinya, you go slow and move the body parts with precaution while maintaining a steady flow and a structured rhythm. Power yoga is carried out quicker than regular yoga."
    },
    {
        "YogaStyleName": "Beginner",
        "YogaStyleDescription": "Calistoga Yoga's beginner class is for anyone new to yoga. The course involves fewer poses so one can adjust at their own pace. This course is also recommended for anyone looking for a lower impact class. Normally, poses can be held for one minute or more but the instructors will limit each pose time to half allowing yogis time to adjust."
    },
    {
        "YogaStyleName": "Hatha",
        "YogaStyleDescription": "Hatha yoga is a branch of yoga which uses physical techniques to try to preserve and channel the vital force or energy. The Sanskrit word haṭha literally means 'force', alluding to a system of physical techniques."
    },
    {
        "YogaStyleName": "Mindful",
        "YogaStyleDescription": "Calistoga Yoga's Mindful class is specially designed for those with a 'running mind'. The movements are comparable to classic forms of Vinyasa but include a mindful technique and have been described as poetic and lightening."
    },
    {
        "YogaStyleName": "Prenatal",
        "YogaStyleDescription": "Prenatal yoga is designed for pregnant women. Yoga is intended to create a balance between emotional, mental, physical, and spiritual dimensions. Prenatal yoga is about helping you prepare for childbirth by relaxing the body and focusing on safe techniques and poses in all stages of pregnancy."
    }
]